Revit 2026 API

# FamilyItemFactoryNewReferencePoint(Transform) Method

---

Create a reference point at a given location and with a given coordinate system in an Autodesk Revit family document.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ReferencePoint NewReferencePoint(
	Transform A_0
)
```
```vb
Public Function NewReferencePoint (
	A_0 As Transform
) As ReferencePoint
```
```cpp
public:
ReferencePoint^ NewReferencePoint(
	Transform^ A_0
)
```
```fsharp
member NewReferencePoint :
        A_0 : Transform -> ReferencePoint
```

#### Parameters

A_0 Transform

#### Return Value

ReferencePointThe newly created ReferencePoint.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the argument is . |
| InvalidOperationException | Thrown when the family is not a Conceptual Mass Family. |

#### Reference

FamilyItemFactory Class

NewReferencePoint Overload

Autodesk.Revit.Creation Namespace